podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/MCG_LITE_MKL17Z4.svd.xml
<!--
Devices using this peripheral: 
      MKL17Z4
      MKL27Z4
      MKL33Z4
      MKL43Z4
-->
      <peripheral>
         <?sourceFile "MCG_LITE_MKL17Z4" ?>
         <name>MCG</name>
         <description>Multipurpose Clock Generator Lite</description>
         <groupName>MCG</groupName>
         <prependToName>MCG</prependToName>
         <headerStructName>MCG</headerStructName>
         <baseAddress>0x40064000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x2</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x6</offset>
            <size>0x1</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x8</offset>
            <size>0x1</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x14</offset>
            <size>0x3</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x18</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>C1</name>
               <description>Control 1 Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x40</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>IREFSTEN</name>
                     <description>Internal Reference Stop Enable\n
Controls whether or not the internal reference clock remains enabled when the MCG enters Stop mode.\n
(only if IRCLKEN is set or if MCG is in FEI, FBI, or BLPI modes before entering Stop mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRCLKEN</name>
                     <description>Internal Reference Clock Enable\n
Enables the internal reference clock for use as MCGIRCLK</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>LIRC disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>LIRC enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKS</name>
                     <description>Clock Source Select\n
Selects the clock source for MCGOUTCLK</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Selects HIRC clock as the main clock source. This is HIRC mode</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Selects LIRC clock as the main clock source. This is LIRC2M or LIRC8M mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Selects external clock as the main clock source. This is EXT mode</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2</name>
               <description>Control 2 Register</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>IRCS</name>
                     <description>Low-frequency Internal Reference Clock Select\n
Controls the LIRC to work at 2 MHz or 8 MHz mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>LIRC is in 2 MHz mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>LIRC is in 8 MHz mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EREFS0</name>
                     <description>External Reference Select\n
Selects the source for the external reference clock</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>External reference clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Oscillator</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HGO0</name>
                     <description>Crystal Oscillator Operation Mode Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Configure crystal oscillator for low-power operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Configure crystal oscillator for high-gain operation</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RANGE0</name>
                     <description>Frequency Range Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Low frequency range selected for the crystal oscillator</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>High frequency range selected for the crystal oscillator</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1X</name>
                           <description>Very high frequency range selected for the crystal oscillator</description>
                           <value>0b1X</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>S</name>
               <description>Status Register</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x4</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>OSCINIT0</name>
                     <description>OSC Initialization Status\n
This flag, which resets to 0, is set to 1 after the initialization cycles of the crystal oscillator clock are
completed. After being set, the bit is cleared to 0 if the OSC is subsequently disabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>OSC initialising</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>OSC initialised</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKST</name>
                     <description>Clock Mode Status\n
These bits indicate the current clock mode.\n
The CLKST bits do not update immediately due to internal synchronisation between clock domains</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>HIRC clock is selected as the main clock source, and MCG_Lite works at HIRC mode</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>LIRC clock is selected as the main clock source, and MCG_Lite works at LIRC2M or LIRC8M mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>External clock is selected as the main clock source, and MCG_Lite works at EXT mode</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SC</name>
               <description>Status and Control Register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>FCRDIV</name>
                     <description>Low-frequency Internal Reference Clock Divider\n
Selects the factor value to divide the LIRC source</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Divide by 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Divide by 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Divide by 4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Divide by 8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Divide by 16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Divide by 32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Divide by 64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Divide by 128</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCTRIM</name>
               <description>High-frequency IRC Coarse Trim Register</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>COARSE_TRIM</name>
                     <description>High-frequency IRC Coarse Trim</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HTTRIM</name>
               <description>High-frequency IRC Tempco (Temperature Coefficient) Trim Register</description>
               <addressOffset>0x15</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>TEMPCO_TRIM</name>
                     <description>High-frequency IRC Tempco Trim</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HFTRIM</name>
               <description>High-frequency IRC Fine Trim Register</description>
               <addressOffset>0x16</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>FINE_TRIM</name>
                     <description>High-frequency IRC Fine Trim</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MC</name>
               <description>Miscellaneous Control Register</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LIRC_DIV2</name>
                     <description>Second Low-frequency Internal Reference Clock Divider\n
Selects the factor value to further divide the LIRC source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Division factor is 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Division factor is 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Division factor is 4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Division factor is 8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Division factor is 16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Division factor is 32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Division factor is 64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Division factor is 128</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HIRCEN</name>
                     <description>High-frequency IRC Enable\n
Enables the HIRC, even when not working at HIRC mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LTRIMRNG</name>
               <description>Low-frequency IRC Trim Range Register</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>STRIMRNG</name>
                     <description>LIRC Slow TRIM (2 MHz) Range</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Frequency shift by 10%</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>No frequency shift</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>No frequency shift</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Frequency shift by -10%</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="STRIMRNG" > <name>FTRIMRNG</name> <description>LIRC Fast TRIM (8 MHz) Range</description> <bitOffset>2</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>LFTRIM</name>
               <description>Low-frequency IRC8M Trim Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>LIRC_FTRIM</name>
                     <description>LIRC8M TRIM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LSTRIM</name>
               <description>Low-frequency IRC2M Trim Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>LIRC_STRIM</name>
                     <description>LIRC2M TRIM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
